Revit 2027 API
PartMakerMethodToDivideVolumes.GetSplitRefsOffsets Method
 Returns offsets for plane-defining splitters.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IDictionary<ElementId, double> GetSplitRefsOffsets()
Public Function GetSplitRefsOffsets As IDictionary(Of ElementId, Double)
public:
IDictionary<ElementId^, double>^ GetSplitRefsOffsets()
member GetSplitRefsOffsets : unit -> IDictionary<ElementId, float>
Return Value
IDictionary<ElementId, Double>
See Also
Reference
PartMakerMethodToDivideVolumes Class
Autodesk.Revit.DB Namespace